{
  "_metadata": {
    "description": "PS4 Error Code Database",
    "lastUpdated": "2025-10-28",
    "totalCodes": 50
  },
  "CE-30002-5": "Cannot access the content. The application may not have been installed completely. Please delete and reinstall the application.",
  "CE-30005-8": "Cannot access the HDD or Blu-ray disc. Restart your PS4.",
  "CE-30008-1": "Cannot access system storage. Restart your PS4.",
  "CE-30022-7": "The application has crashed. Report the problem to Sony.",
  "CE-32809-2": "Cannot download file. Check your internet connection.",
  "CE-32883-4": "An error occurred during update. Restart your PS4.",
  "CE-32889-0": "An error occurred while updating the application.",
  "CE-32895-7": "Latest update file cannot be installed. Storage may be full.",
  "CE-32920-6": "Cannot continue using the application. The data is corrupted.",
  "CE-32928-4": "Cannot access content. The disc may be dirty or damaged.",
  "CE-32930-7": "Cannot start the application. The system software may need to be updated.",
  "CE-32937-4": "Application data is corrupted. Delete and reinstall the application.",
  "CE-32947-5": "Cannot download content. The disc is needed to install the application.",
  "CE-33027-1": "Cannot purchase content on PlayStation Store at this time.",
  "CE-33729-4": "Cannot connect to PlayStation Network. PSN may be under maintenance.",
  "CE-33743-0": "Internet connection lost.",
  "CE-33945-4": "A connection to the server timed out.",
  "CE-33984-7": "Cannot connect to PlayStation Network within the time limit.",
  "CE-33986-9": "PS4 cannot obtain an IP address within the time limit.",
  "CE-33987-0": "Cannot connect to the WiFi network within the time limit.",
  "CE-33991-5": "Cannot connect to server. PSN may be down.",
  "CE-33992-6": "Cannot connect to the server. Check PSN status.",
  "CE-34054-6": "An error occurred with the application. Save your progress and restart.",
  "CE-34335-8": "PS4 is too hot. Move it to a cooler location.",
  "CE-34452-8": "An error occurred during the download. Connection may have been lost.",
  "CE-34544-0": "Application installation failed due to lack of storage space.",
  "CE-34632-8": "Update file cannot be recognized. Re-download the update file.",
  "CE-34788-0": "Blu-ray disc or DVD cannot be played. Disc may be damaged.",
  "CE-34861-2": "An error occurred while playing a video file.",
  "CE-34878-0": "Cannot start the application. The file may be corrupted.",
  "CE-35239-5": "Cannot install system software update.",
  "CE-35287-5": "Cannot complete the download. Check your internet connection.",
  "CE-35340-5": "Internal error occurred. Restart your PS4.",
  "CE-36244-9": "An error occurred. Try again later.",
  "CE-36329-3": "Cannot access PlayStation Network. Check network settings.",
  "NP-31734-4": "Cannot connect to server. PSN may be under maintenance.",
  "NP-31735-7": "The server is temporarily unavailable. Try again later.",
  "NP-31747-0": "Cannot connect to PlayStation Network. Internet may be disconnected.",
  "NP-31753-4": "Cannot sign in to PlayStation Network. PSN may be down.",
  "NP-31775-8": "Cannot access PlayStation Network at this time.",
  "NP-31826-6": "Your PS4 has been banned from PlayStation Network.",
  "NP-32038-6": "PlayStation Network is currently undergoing maintenance.",
  "NP-32062-3": "Credit card information is not valid.",
  "NP-34924-2": "PlayStation Network connection lost. Check internet connection.",
  "NP-34953-4": "Cannot sign in to PSN. Check network connection.",
  "NP-34958-9": "PlayStation Network is temporarily unavailable.",
  "NP-36006-5": "Your payment method has been declined.",
  "SU-30625-6": "Cannot download system software update.",
  "SU-30627-8": "System software update failed.",
  "SU-30645-8": "Cannot update system software via internet.",
  "SU-30696-4": "Cannot install the system software update file.",
  "SU-41333-4": "Cannot install system software. Update file may be corrupted.",
  "WS-37397-9": "This PSN account has been temporarily suspended.",
  "WS-37398-0": "This PSN account has been permanently banned.",
  "WS-37403-7": "Cannot connect to PlayStation Network. Console may be banned.",
  "WS-37431-8": "PlayStation Network is currently undergoing maintenance.",
  "WS-37432-9": "There is a temporary problem connecting to the network.",
  "WS-37469-9": "The PSN servers are currently busy. Try again later.",
  "WV-33899-2": "Connection to media server lost.",
  "WV-33907-2": "Cannot play video. File format may not be supported."
}
